#pragma once

// PLAYERUNKNOWN'S BATTLEGROUNDS (2.5.26) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Char_AnimBPv2.Char_AnimBPv2_C
// 0x352C0 (0x35F20 - 0x0C60)
class UChar_AnimBPv2_C : public UTslAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0C60(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_DuplicateTransient)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5384409142DFBCCD773E298486F19EB4;// 0x0C68(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D25A50DB44F95F2B1A2984B72DE91BDC;      // 0x0CD8(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2BB5BC224AC3DB15F09228A063A7C770;// 0x0D38(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_14B484844A22DCD106310FB89E8C5F99;// 0x0D88(0x0050)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C6DE787949440CC1E98B018226BF8D46;// 0x0DD8(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_39820FD3426C230657A6EAB76A793969;      // 0x0E48(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E7CD7A37495466F1238098AA210655C0;// 0x0EA8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1650E88F48A8D7291665E5B04F8BD216;// 0x0EF8(0x0050)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_A24E25D846A1A51D763A3FB4FE3419CD;// 0x0F48(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_623A0A6E4A572948382F319BD00F1523;      // 0x0FB8(0x0060)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_804AB27840A59ACAD35CA7BA967120C1;// 0x1018(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BD557F9F4E2870ECA05AB2AD8431B5C2;// 0x10C8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C8EE8A554114578D74D1CEBEBEFB2F26;// 0x1110(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8AAC10724CE75B44BB9E4ABA09A54C8E;// 0x1158(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1EDD971B4803D3FF1E56E58EF84A8717;      // 0x11A8(0x0060)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1208(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5EB8EE29421CF154894E1CA49BCF8249;// 0x1210(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EE5B4834269B63DCAC2F4A6642F458E;// 0x1290(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5372E9D444B7D4E71CFE11AB0D49398D;// 0x1310(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96B56C1042FF0031A1D94283EEBB9714;// 0x1390(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14A719944645A55E2D949EB656A28158;// 0x1410(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96E641654B3A33D8CC2307A87C2100E5;// 0x1490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4BEBE984CD380D463C491AD34637E8B;// 0x1510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51FDB48345A14C7F51CDA08F0A9D5F01;// 0x1590(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEC1618E44576D01F8FB579827AF1C97;// 0x1610(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91A2675F414F4E32CE9E24809824492D;// 0x1690(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EAC2D7346BB207040CF2D839B416749;// 0x1710(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4355646B4F112B10637F71A96D4D60CF;// 0x1790(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_493B8F5344796C6F8827F5A045C66A51;// 0x1810(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0EA67DF45324677A68D458E2FB46C7D;// 0x1890(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC13B6354C1B3BEB47F4D88A059EA527;// 0x1910(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60DCFD9B4AEC019079E1CB9F565BAEE7;// 0x1990(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA85397240A7D9DC977CA09053607866;// 0x1A10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C49D09C843BB2DF12BE41DBF335A93AE;// 0x1A90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_08E2D8F5458F07774F7A43AE7F4C74EB;// 0x1B10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C11882C7486576D53272E0B0E89A6810;// 0x1B90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6F09FC74019CABCE914408BBBA7E1E6;// 0x1C10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71007E3F409C0D422E456E9A207BE2DC;// 0x1C90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_512AC8CA408F4279B1E71C81FA372E33;// 0x1D10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D945AA041CD7F2759098C9405526BEF;// 0x1D90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91DF52EA4A4CF8EA5F723197414A3FCF;// 0x1E10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_202EC6C74C689E237CFA7D95A9505CFD;// 0x1E90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2C737AB43156D72498BEF80DD0D8FEB;// 0x1F10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_965D2B67478E6C59C30222954EC73714;// 0x1F90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C7549964C6EE3D0D90004BDEA459E48;// 0x2010(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF8B1544B7837021A07D7AFC05371E6;// 0x2090(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C14C5DA44B77320E450A7AFE7DD9647;// 0x2110(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_564EA197477F67F8662ED4A7CA6234DD;// 0x2190(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E982E504E3DD3204E1F298861AF2988;// 0x2210(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C243144D4E8F6DA177C9648D355460EA;// 0x2290(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_854E5CE840B623F8BC0063A2C28341CD;// 0x2310(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C35FE9214087EC2871B19CA4C3508B80;// 0x2390(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C26A0C8C45908363DD8BB8911F1D36D7;// 0x2410(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_757F4E844CC8AE1956196B98158F7A33;// 0x2490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DA0D980425B68B6D162AB83C9F88EB3;// 0x2510(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_63348A2A4F54FEFAFD0421A6628AC8C1;// 0x2590(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9377D7BF4FF4C12077040A9DA7940746;// 0x2600(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_38BC2AF249F0BEC83135809C1332A5DD;// 0x2648(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CFDA4D3C4E8EBF28D2C5FFA54EF87447;// 0x26B8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2FB209574424E1698CC74B81BBBF05E4;// 0x2700(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0D2156EE4FDC0B5DCBD7A6BAC3CAAE1D;// 0x2820(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8D80301F492FD19A54BD1B8A62A6FA30;// 0x28F0(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_47A1A07245F59C50B195E5A5427B7221;// 0x2A10(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8103FA5F4C0CB312F926CEB70B56A55A;// 0x2A58(0x0060)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A8F393734CC76D037FFDEB8876400082;// 0x2AB8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_257F27874C831EF69A941391BFBE286F;// 0x2B28(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BD9D77CD440FA808C3E75CA8D9B163CD;// 0x2B70(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_F6ADD0064DC65F883F07C9AE1DEB5BBF;// 0x2BE0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AE6E7FE544AF01E92FB8ED935EB21BD8;// 0x2C40(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_1A20D6F2407BEA9D69626EBC03F1A9D5;// 0x2C88(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_26256E2943D957A12749F38C83805F9A;// 0x2CC0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_93958EDD42A5F4A28EF35EA7BBDC936F;// 0x2D08(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2ABB350D4D6517BF93611CA8A239D020;// 0x2E28(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_093E98A04163C4C1849B6D84AAF48BF4;// 0x2E70(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12D71E21431B129712F216B33BA5EA36;// 0x2F90(0x0120)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7E10B64C47806E0DCF1F9DA996A70C84;// 0x30B0(0x0078)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_9EF929E846E4CDFCB34097AD9B51763C;// 0x3128(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EC9A302A4963E232E2C5EA898209B78C;// 0x3188(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5F9FAE1747ACE355F888D087B8A50632;// 0x31D0(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C88F4904B57CC38C2F89F942565A8FC;// 0x32F0(0x0120)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3C874FA64B7A5E2A9694FE8D27E9863B;// 0x3410(0x0078)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_E90C3E2C40D6DBB008C3C788E86A12EA;// 0x3488(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF32912D4297182E5305629DD44FC68F;// 0x34E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BAA9AA9430A30EEBA86FFBC4B1F0E51;// 0x3530(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D59E44864DF2AFC44D205DB43A7A3552;// 0x35B0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D50747774E782D9CAE440FBDE81786D4;// 0x3620(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A0996A54EAB338C10566CA41ACADE70;// 0x3668(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_573BEA494126A2229EC949B770E208B7;// 0x36D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E8548864916DE4E9169558FB62A4BAC;// 0x3720(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4FDBB55844CB488F85E4B381C1713AB2;// 0x3790(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBB0247844C16B537C7C62889EBA9B3B;// 0x37D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B6FB9F4245B2025FB414DDB088BFC375;// 0x3848(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B82CB7946B691BE3991F595EAC5217B;// 0x3890(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7DB679B2493663295976E1886E1D6C38;// 0x3900(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_97CCD3B741ECEFE46C487887C21AB00A;// 0x3948(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A2CDE1E44149170E997EDA9D54DB3F3;// 0x39B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDF638F24488D5EC2BDC488D2B20F5E8;// 0x3A00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2C120894201A8D14D50B08C16F860F4;// 0x3A80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_808257694B3B4B40F38423B8AF0FDCC9;// 0x3B00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9B8D4214B221A6D7A7EF3AE9323752A;// 0x3B80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5EB447B489AD0D4E1FE8796FE086E32;// 0x3C00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_08FD0296479D08F751548A9FDAF1BD76;// 0x3C80(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BC28479F41346920D97DA3BE1F6109BC;// 0x3D00(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F8732C994AF600225665159AB18506FF;// 0x3D70(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_398707064E6338AB913986B99A721B29;// 0x3DB8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_79F778344EAE598FD31CAAB2D8133727;// 0x3E28(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_250F2953490EE68B80B902A7E66531E9;// 0x3E70(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6C765CDA4AE2E56A5F8FA2828D53935D;// 0x3EE0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3FE34F3949FC450169DD73874BC5376A;// 0x3F28(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3359BBD04BA2127AAF14EC95B6DBD419;// 0x3F98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ACC2D0A54F3E4700C8D38299B68CE3B1;// 0x3FE0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BCAF73484F3E34D808F89297E41D3456;// 0x4050(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4D2D7E7486DE860B6EA16A5A08863B1;// 0x40C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C55879A245271AA57FBA57908250630A;// 0x4130(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD290D3D47DB37D6C99B7DA413442CF7;// 0x41A0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4D83488141A0031A37DC8DA7048F52F5;// 0x4210(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FBB5433745834EE8079AB099BAC36C77;// 0x42E0(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_EE197F0E4163BEE399841482EC0FB4FF;// 0x4350(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D15D49DF429ABA9A19CF1FAA2EA2D883;// 0x4420(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFF5EAD94FF280D331BDAA86B1609E1A;// 0x4490(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B96F77DD46C4EF0075407F93AC93F97E;// 0x44D8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D53DB7CB42FAF835DCDB239D507AABDB;// 0x45B0(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0x45F8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45BEF38646B6B5814F6AD592CCEE9903;// 0x4600(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98F5775944EC82F4216B0881746D5170;// 0x4680(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F105D0D443E49181314B259981ED776C;// 0x4700(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEBDE62D4AF33C3C6AE3BAA7A3D3D6D4;// 0x4780(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57186FE44995720F644036B89C72EDD4;// 0x4800(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CE68CA247D3CDE4C8B4A9B2EE42454F;// 0x4880(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_505322F74EF5443CAA74CEACF00D755A;// 0x4900(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9E326F2D410217FF1D8A6A8C2ABD2477;// 0x4970(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_DA3A84B445969B07C38F7E845C669F49;// 0x49B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C09423664A81C30008394A9B384DB38C;// 0x4A28(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A568D8844ACC5BAB58D233AB9F8C281C;// 0x4A70(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01C2E43545B875EF43CF1D91D8E38A2A;// 0x4AE0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_08DEDE5C4CE0BDC39327B29864FA7714;// 0x4B28(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11ACA1A04E4FAD7FEDA657A0D42DC93A;// 0x4B98(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FCABA18D446418A855292696CD86ED94;      // 0x4BE0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3704AFE5432459D93754E4AD5F06EBBB;// 0x4C40(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67E27F2D465A32A9346319A4921C745A;// 0x4CB0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_75DA484F4C5CC5BFBEF8B78A0168DE64;// 0x4D20(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DE77EAE490AE2C6CF522E9ADDFFE17C;// 0x4D90(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54C07EA840FA84B101B8E39217F29778;// 0x4E00(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7335C94B456569EBA7004EAA82C43B5D;// 0x4E70(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10CEEBB04451CF0382FC5E8787DA024C;// 0x4F40(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_4B372DBA43A9A34344F925BD5BC1627F;// 0x4FB0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8D865DA468B2D529DF5B29707886D7A;// 0x5080(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2D2FFA4746E0DF8F23A75994F862B7AF;// 0x50F0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3165E27A4A9355207ED784B014BE11E9;// 0x5138(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7775A8F846D871FB90E3D5B3081ED418;// 0x5210(0x0048)
	unsigned char                                      UnknownData02[0x8];                                       // 0x5258(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8690AEF7471E58BC52B70E88DEB2CAF2;// 0x5260(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B3CA17F24BEF5E0D5F0EC4AF3ECD999D;// 0x52E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35AEF33E41852067415E8CB8B28E88FC;// 0x5360(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BE18E4CC45116547E13B93AC3D00AA65;// 0x53E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11448E3C48BF7479A8DCDDA7CF459B8B;// 0x5460(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86BEFA1542F0648055D0AB919332A306;// 0x54E0(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F93DCBC44152AF6CD5E7A8948FDA27FA;// 0x5560(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1C5439FB40A668125AB3E68AF348F2F5;// 0x55D0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FAEED3A045CF4DFFD6EE06938E19CFB5;// 0x5618(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D09F807842ED417969291B8B43797776;// 0x5688(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_358D2EF5404F507E0198F686E49FDE4E;// 0x56D0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8BBB2F0B4EB4C11F18BB62A2DCEEA5B9;// 0x5740(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3D14D8B34D308DCD4C18E1BCA3FBA764;// 0x5788(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADA27C6D4A2CBAACABE5D292262CBA10;// 0x57F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEA8B62344571896366620BD148B0307;// 0x5840(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_076B25B24919775A97B4F88ECB04578A;// 0x58B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_78252BC744F0D5D402938AA2F39224ED;// 0x5920(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2117811E449A9B351045BA97DE80B897;// 0x5990(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F9FCF9C84D4A55AEBEB0BD88C544A915;// 0x5A00(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7394DB244B647184C495F7AB4C077FE1;// 0x5A70(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_668CA78E425E05F35408729E4F933767;// 0x5B40(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_9003558C4E90458EC8238A970C2CC9F2;// 0x5BB0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_97167E1F492409F0DB108395C0E4C50C;// 0x5C80(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A3799887442AEB6448FCF7812D15A22D;// 0x5CF0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_872F51F54C7B7DE5DCE6EFBC845D5F05;// 0x5D38(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_34C62A7D4A9DA3CF0B65A192FBD57C63;// 0x5E10(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_913D91104CA562490AD102B7BF3100E7;// 0x5E58(0x00D8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_976486E84E963D6ABF40B1AD144EEA31;// 0x5F30(0x0140)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A91F1F25423C39C88712EE931212BD00;// 0x6070(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_80E9D95842209DA40C590E9785036922;// 0x6118(0x00A8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_731E35C84DDCB5B148A6D787114FAB73;// 0x61C0(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1BBDFEBC4EC3B2551FBB48B968BB5BCE;// 0x6230(0x00A8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1A5AFF65435CD0DE0AD9CBA3E2A1C0AB;// 0x62D8(0x0120)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8D4B93BA47E90C34CCB87D9AA3386DD6;// 0x63F8(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FCB82CB540FC2332DB96CEBCF4F2FF58;// 0x64A0(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1FF4DF0849B7A12D869DA0907CA011C5;// 0x6548(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D2548CA462333433B22BE8424682A76;// 0x6598(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_21B7215D40207A20CA97D18BCC18D6E5;// 0x65E8(0x0048)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_90FB9ECE4AE3E896D6D0AC94F75B7F4E;  // 0x6630(0x0098)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_99C700EE44B8D42AADA80BA2B92532A9;// 0x66C8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7781F0524789D95128012E8871F00C32;// 0x6710(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_23ACBFE140B0A21FA653AB9A439A7FC6;// 0x67B0(0x0048)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_93407647484144383070E69DAA407632;  // 0x67F8(0x0098)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_8024EE7D47842CC69FBA67AE47F7F150;    // 0x6890(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D8514E9C4E7C959D9582C2BA9B2A7310;  // 0x6980(0x0098)
	unsigned char                                      UnknownData03[0x8];                                       // 0x6A18(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_8E2961C147654E29EF95F2B32EECA689;    // 0x6A20(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_407FE8F7466213C2B871B49879A72646;  // 0x6B10(0x0098)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_66BCF02E47E5ED52681DC884497D5213;// 0x6BA8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8F918DD846F655F130E2009CD8A4592F;// 0x6BF0(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1CF6FF16414F14C2D7F5099BD5A1E16D;// 0x6C98(0x0048)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_7A4AE6874E78217ED845F7BCC2E78C16;    // 0x6CE0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_09E4E4394714772CFFE9FDB1F7C3AC3A;  // 0x6DD0(0x0098)
	unsigned char                                      UnknownData04[0x8];                                       // 0x6E68(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_91BA71EE4906B5B2EB1E0F98B61A0325;    // 0x6E70(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_12F900E4499CB28195F7D1A699C8C289;  // 0x6F60(0x0098)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_7DE1B84D4AE81EB950218A99F01EBC4C;  // 0x6FF8(0x0098)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_070E39444079D074232F5F82909098DB;// 0x7090(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_075BBB9E45F5F7AE43AFE0A79D68EE30;// 0x70D8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A858B9314D63B74BC2177FB0483E708B;// 0x7128(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_66DF0BA846AC3A630C29C98C11C22F4A;// 0x7178(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BA30EC1F40D58D30A57158835A5ADAA2;// 0x7248(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D7E9A45741D7504458F59BB5781D8A6C;// 0x7298(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E5C1E8584B6ECC807A516883236A89A5;// 0x7338(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_68B7E3F143B92096F5CE8EB543BA3E89;// 0x7388(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5C63E3834D0A5F1F6EBF5DBD6E4DFA9D;// 0x73D8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9590279B4C39732BEE628DBC6FC4518D;// 0x7478(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BBD105DF4773567CD5B6C09D2F3719B7;// 0x74C8(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_89E8F3D64F50F9929E6C87BAF4622B74;      // 0x7518(0x0060)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_464CFEAC437EF91B6D40A7A1AE2205B2;  // 0x7578(0x0098)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A633D26C40CFC38CB9EE5A9BF052A759;// 0x7610(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_66D280B348F6AB1F012DBABEC5630211;// 0x7660(0x00A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_91175C984242C8A225D6619BAE536B2B;  // 0x7700(0x0098)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_71E15DE84DD0E01B8D465F8ED86176E9;      // 0x7798(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_531305454E29E3B9D085989E83015159;      // 0x77F8(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2C4F32544231436935980EAED40F0007;// 0x7858(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_BA68B2CB46837A91CA16D69D91FD791C;      // 0x7900(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9FCE4FA64F9E63CDDC74888D061DF726;      // 0x7960(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AEBB7F5C4FBE3AD89299438A4A7C275E;// 0x79C0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4F6F86124ADE386022CE5780D6DEEB91;// 0x7A10(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_59AAB4FD49C009328EDFEFB5D25C0CCE;// 0x7A60(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_16244A094C263A588D2601A3F1661508;// 0x7B08(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F6BF2D554B37A68C0239BD9533B42A90;// 0x7B58(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8E8E39424DB7990719E36582196C7DA0;// 0x7C00(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_55708F3F468169F2CE8DB29AB098CBB6;// 0x7C50(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F8C9269A474A0788BDB7BDBA0C8A00DE;      // 0x7CF0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F6CEBAC4455835C02954CF9EF55469F8;// 0x7D50(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E94F07684CACFD7161055DAE0D070464;// 0x7DF8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0F1E73DE4BF1265516EA38B8A1C27190;// 0x7E48(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F5974CF5430BEF8E77B18999E5DF3063;// 0x7E98(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1FA6FC9844E6331FB1CE03B80BD1CBCB;// 0x7F40(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4A835CCC43C01F39660CDE9539CF68A2;// 0x7F90(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_670C38B8459FF49FA9BF99AF2FC44B75;// 0x8060(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9BCFD0374B4827A9CB53FA9998DDC9B7;// 0x80B0(0x0140)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CFAB5A0548E3BC0DBB68FF91BF158303;// 0x81F0(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FF883D754A24F5F13F052F9A7CF73534;      // 0x8240(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6530FA8348D7FD0466A31683E06286F7;// 0x82A0(0x00D0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CD88546249C8D88A0699E6AA43ACB538;      // 0x8370(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5C7402AF488CA345C8441AA062A7B36F;// 0x83D0(0x0050)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3BA6B85B4F31BFAE016FCFBED649A0B1;// 0x8420(0x0070)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_FAB0086F4889D6F74AA3DFA8F75C217B;// 0x8490(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_599062994CE2615BF93DE3991F1F0191;// 0x8500(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0035A09E45E49017C63E429879B95190;// 0x85A8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D0CF86A14D9B546CEB2253B910C7E1CB;// 0x85F8(0x0050)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8B2DE3A749C46FE06EE3C49C5FA3D1AF;// 0x8648(0x0140)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F3F6D86E4E92F7D68831C3BC038F4ACC;// 0x8788(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F41F8AA84CA39A263DC6E592DCDA5CCF;// 0x87D0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_744DEF314CD42FF1E9B2189BB0F0B336;// 0x8818(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8643788E4872B3F3AD732AB2B3D34F0F;// 0x88C8(0x0070)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9AF094F34042FED9F3203B9D9017E0E8;// 0x8938(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_470483ED44B8D4F25700EE88BE38853A;// 0x89A8(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D64D497B44EF40E99E03DF9C65CD28A8;// 0x8AC8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4209E6BE4C22DEA08DD33CAD10BA5C59;// 0x8B10(0x00D8)
	unsigned char                                      UnknownData05[0x8];                                       // 0x8BE8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_033C349C489360A6F5F1299F5092667A;// 0x8BF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88EB8E9345D04B8A4B8BFBA8C32FF697;// 0x8C70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD3CC9BF416F60097302DDA2DD7A398C;// 0x8CF0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AA4658444793DC7E41AAD9A7A5D2BB4;// 0x8D70(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BCCC7FE946A7A8D61B148C984765AECB;// 0x8DE0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7CFDD8DC439D039DBE1E29B283301F91;// 0x8E28(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_678BF44C4228F298D1058A8B70C6B808;// 0x8E98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB21772441E80F400BF4EABCFF9BB27A;// 0x8EE0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5793451244C81130445B4994FCB1D24B;// 0x8F50(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4116A06E4C03B2C07AC8A5904AD37465;// 0x9020(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_6D1BADA8467646DF360FD894D816429B;// 0x9090(0x0140)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F371BC3487C53960E1D648E265F28E8;// 0x91D0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F13589DF4E9A172E8BD9D8BE6D516397;// 0x9218(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BA2AC4F4A94FF441C48EB881B37DC02;// 0x92F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4AF276547FCBF1C89F4E1BFEC6BDEA0;// 0x9370(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB23A96645755FC79FEB339E7221169C;// 0x93F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12AD2A404D45F5724091AD986258E676;// 0x9470(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91099FD946AD9627E9CCFFADE5A4F75A;// 0x94F0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11CCB28848572DB82C5F50BA8D8EF7D6;// 0x9570(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_712F653E41A1BD0D07F6B3AA5F016146;// 0x95E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24E16EA74B403B28BCB9A09A79D6B6C0;// 0x9650(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_60836302475E73717843349F7CE36ED8;// 0x96C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2114684F436B4FD9B98440AB78BAAAD9;// 0x9730(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_427A5E6244D22DD5F6719485225BE6CA;// 0x97A0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3C5A549D460D26D1738331B4EC5C6426;// 0x9870(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9E73AC4949A75023079750B426D3FD02;// 0x98B8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7F616E7B45B0BE6104A2B8BB2D47AD94;// 0x9908(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0EF837874A55F36096F95CA1985D0AE9;// 0x9958(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ABFA631241C1A2930CDF678BADC6BCEB;// 0x99A8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39F720604886EA309AD2C59A85377A90;// 0x99F8(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF2B007B4237F9B85E8C96B8CFE1585C;// 0x9A48(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3FFE21C04475A0096845EBB2F2F50D24;// 0x9AB8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C505747449C1E0FAD8BE77A07925081B;// 0x9B28(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D653B9354278EEB22A4CA5B53DBFEA23;// 0x9BF8(0x0120)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F6E0C8A14A4D5B5F4528E8AA30F98DAB;// 0x9D18(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3E4A1652439656AE1F27F1BF3576FA31;// 0x9D60(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_83F451E542413F1368F87BB6EB5298DA;// 0x9DA8(0x00B0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1D19F78C48F0CB516E17A790A17282B1;// 0x9E58(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0862CAD64BCBCDE4A2D67F9217A696F0;// 0x9F38(0x0050)
	unsigned char                                      UnknownData06[0x8];                                       // 0x9F88(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_052D00064E38FAC95DADF5AE336AE397;// 0x9F90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4740611D4691647C89D59A97448F4B8D;// 0xA010(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3825E49E41608E3353EB6EBC40BC48CE;// 0xA090(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0ED6A5764AB9B96D3EE07C94F0D35804;// 0xA160(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_E34062EE428E9F700590BD8984B8E219;// 0xA1D0(0x0140)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_090362A646B3B7AB439D1191C3876F62;// 0xA310(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_15F0CA944A463540B051CF9FFEB184FC;// 0xA358(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F87130B0485E8CB6E7E5F2A993AB9E8A;// 0xA3A0(0x00B0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_DD46B9F84581C1FB80893AB00EFE5C5B;// 0xA450(0x0140)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CE5EC054BAB2A799DE6E4B30A4FF656;// 0xA590(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4040D82147E0CB03D2986AA4C8558D15;// 0xA600(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_846C752C453DCCEE2F2E8881F272A245;// 0xA6D0(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3B5E914E478216E8FC3369A6FC0C5C3E;// 0xA740(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_81211C7545D56EDBAF1BF5BD30088E65;// 0xA7E0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F6B915714CAC86F06EF684AF18CA8CA8;// 0xA828(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_57B4BB124654A546BD0804896F70051F;// 0xA870(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F5C4B66D4EC41B19FA580B986567CBAE;// 0xA920(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_35C0EE824A4B6B7F2AACEBB65C2AF244;// 0xA990(0x0140)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E908DB6F48867631E67189B7C61519BF;// 0xAAD0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7C8C62EB4A67A5F63B4241BBBF6BEFE8;// 0xAB18(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5D1978E64C8C4B64F834DE95736B8E0F;// 0xABE8(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_FEDAD493492FF4249D1BE681231EA248;// 0xAC58(0x0140)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DE2B4D9D41D2F6B183599997C3F7A6A2;// 0xAD98(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2CDBB6DE4C7E4C2D2271DFA7ACC5BC61;// 0xADE0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C5EA103949EB4E82A12EF2924265ECDE;// 0xAE28(0x00B0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_06196C5645EDC12C7B69E7BB1FDB56AE;// 0xAED8(0x0140)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E55393F44DFB1DC1B117CBAC12D2499A;// 0xB018(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4705C50F4E5E2AAF0D02C4A8D5403641;// 0xB088(0x00D0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_582E6FC546E8F71133E6CD8B065CD724;// 0xB158(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C38C09D6464AD2D21F76F4BD82234A6E;// 0xB208(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DD4AB90B442F1CFCC24F83B26DAD2E22;// 0xB250(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8776479349E1422A6EFB05AD2B6C78E0;// 0xB298(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2FBC8E14505A8E343D6E49DFE50996D;// 0xB348(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_722C1E04476795294C45F5989A08348D;// 0xB3B8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31E37F724D47540FAD8E95A2BFA51630;// 0xB458(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_905404884D4B272FD55A78A472E44947;// 0xB4C8(0x0140)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B8155D3B40BCC80A5160B38BDD3DADA8;// 0xB608(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5563875F474A758CC464368458FA5A6E;// 0xB650(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_785ED1224F3BD7012395A4B68E191137;// 0xB728(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_03C033554A0979BF00F87C8ACBD35C03;// 0xB7D8(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DBA87C2040162EE6AFABA392C61F0DD8;// 0xB888(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F2BA41ED4491EB784EB299982DE7E351;// 0xB938(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_367630CE4576D15975D8DF983426AE0C;// 0xB9E8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_41C1D2FC4E92A8B01A42E9A3F7C31A97;// 0xBA30(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_73E85B9243753AC6B00B03A99760DEBF;// 0xBA78(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2E13244B410917023F975A8D12A74DF7;// 0xBB28(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6F34F3A843B1A0AF638321BCAF3C69BF;// 0xBB78(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_69F141254F384C10006D118D6C8A5A7E;// 0xBBC8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B6E5B5143AF5733972483A2A2CDA918;// 0xBC18(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04142D9C44078DEEE012F9BF8347A30A;// 0xBC68(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C0E260FA41A3A922D2EF64A09573E195;// 0xBCD8(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_D20B84DB452FBC2819BE10B956D554E3;// 0xBDA8(0x0140)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_C7B1E22C40F4BF6829C36D9F60F63521;// 0xBEE8(0x0140)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EFB94DD24DFE42A1588525B07D2F409B;// 0xC028(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_85648043414920281A55078B25C18055;// 0xC078(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_695ED6D84B1D4890B13B4191A61B8515;// 0xC0E8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_AF055DF146A4FF99FB4069B4023A3A19;// 0xC138(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B71621204AD6561A07968B858BE2AAAA;// 0xC1A8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45C5618246B73D3589392DAFEEDE9350;// 0xC1F8(0x0050)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_5DEC5ABC4F1C301BD126FCAA0C314A12;// 0xC248(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CC556E341289C147D87B380072AC1C1;// 0xC318(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_816C286744F09BED5FC47AB17B95091A;// 0xC388(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_C643F6DD4CE5225ABC740FBA851A9ED7;// 0xC3F8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B5B8FDF24AF69B3D0CB16CB444972B40;// 0xC468(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A10AEB541EBA8510B2990A841056C8A;// 0xC4D8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_353A36984EC96BCC8FC5CBBA4023AA55;// 0xC548(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B351CB4544A4FDE9F2B6DDBDD821CF75;// 0xC5B8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CC46F0A24C06FA8039836EA226A51FBA;// 0xC628(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F32ECEC94588C5AD9F4F6D9F147C4017;// 0xC698(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FCA2969B4E73C404505EFB93E4013B74;// 0xC708(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A2EF9CE8451FF8CD35C0A68DD18A9388;// 0xC778(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4589A8074111CB2FD28BA5A20621F8DA;// 0xC7C0(0x0080)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_30DA0C414CB1F599E76077851535C977;// 0xC840(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8F694E3243E571B6E12D31ACB47FF10C;// 0xC878(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5FE6AF6343F2753EE5603DB2342BFC64;// 0xC8C0(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31BF9FE14FD005A8095D1D9841FF3BF4;// 0xC998(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D3E45EC4C9F138A1405D58866D6CFF6;// 0xCA08(0x0070)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_D2699466452708EB0DB34D86C4AC6167;// 0xCA78(0x0078)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_0F11AE284034FAFC4815068AED8CA3A5;// 0xCAF0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8A9211542AA3C232BB3AAB50DDC7D29;// 0xCB68(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B470036A44E3DB15062641A744B5D69F;// 0xCBD8(0x0070)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_1FEEE79845BEB0357A8342BD1B4D6838;// 0xCC48(0x0078)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_67D952294895DEEF361C1FADA8739F90;// 0xCCC0(0x0078)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_E09F0F35428A0F35ED240DAAF665E356; // 0xCD38(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_53070ACA4826B9CE4E9813AE05B697E8;// 0xCDF0(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6477346D4D29F246C3357184901B3122;// 0xCE98(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A796BCD04145FA201C96C4AA641BC3F4;// 0xCF40(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8F77B81B454B25A4FFAE6383C7918915;// 0xCFE8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C0BFDE1344756ED030AEBB9026FA6D79;// 0xD038(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B35F416047C075A4C0EE18AAC2DD0EB4;// 0xD088(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1B45DD934A2007DE9E7C33A9E3428998;// 0xD0D8(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D62903C9490F34A4539671833CD19F97;// 0xD128(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C7F9705B4D18CDBC82138D813A64D85C;// 0xD1D8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B28272EF4D0ABAA90BC36EB2910B3EDE;// 0xD220(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_132CB143410566D2EF2CBC8B9DBE75A9;// 0xD268(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_56579DD442455CB7464F38B460EDA410;// 0xD308(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1BB876B847CFA7932EDEE5B51A790E91;// 0xD3B8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CD1C9D6F4A948B1A7EDCBC8F6397F2B7;// 0xD400(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6A89252F4030FA9880DE86826AA4569C;// 0xD448(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_63D9590F48F645BD5563D7BDE7425DBF;// 0xD498(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_162FECC5469A6F55389A84A2AEC336E2;// 0xD538(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5C66ED4D4C507E2F9A527BA70C219941;// 0xD588(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8C44054743BAB94994FD6DAF19433291;// 0xD638(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_65AA54694C3838B848DE8BB044B66778;// 0xD680(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_54BBCCFA4BE5DAD4AEADB798BEE58A2E;// 0xD6C8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E016CF804D9C25B2450A5BA544F5861A;// 0xD768(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7632FC9B430C815AAC9182BDB80DB5F1;// 0xD810(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_08E273944BA423288FB1AFAC02C0E3FD;// 0xD858(0x0140)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9EE3EB32490EC53CC787FD98ADB0956E;// 0xD998(0x0048)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_7B3D86E14C7A3EC1792337B720553AD6;// 0xD9E0(0x0268)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_B13F20DF472BC00F1D7199A83F7757A5;// 0xDC48(0x0140)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_022C7A58414B2F0726AFF2B92E364112;// 0xDD88(0x0140)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_1A2DF59C4FEB6A12B2AEFA97323D0A25;// 0xDEC8(0x0268)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_432A6A6C485B89C15BDD3F9B1FCF3BAC;// 0xE130(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_227D523948D920617DEAE394BCAB988B;// 0xE180(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_912615914DCBE1C761A9D1883C0DE142;// 0xE250(0x0140)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5D5522204382C49E9685D0B88DC3E8E7;// 0xE390(0x0050)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0183C3294AAF274190B4339FD6FAE8F3;// 0xE3E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_05AA768942FF51A9BC4F53A816E116CE;// 0xE460(0x0080)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_A5195F3647F854A458A9E2985210F58E;// 0xE4E0(0x0140)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_1AC169B040692C2D851D72ADCBBE0447;// 0xE620(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_15F4AD834A856F3298CB219DA17CBC26;// 0xE668(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0420D2BF4BDD9ACAA46A81B5CAF11BF0;// 0xE6B0(0x00B0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_85066D0148ED985D2B236583EDBA600A;// 0xE760(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F3B57ED4E7BC571A5090D8E535AA792;// 0xE7C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C35E9F8542FA7CC3770B2E9FA160C472;// 0xE840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3EA073F42D4EA27CFFEE29E08307266;// 0xE8C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A72264544617227784A8ABB1E5D24C8;// 0xE940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95E51FF04493795CB8701094F8D9462E;// 0xE9C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1CDB9FF4E8B4DDDA23DBD8DF233F498;// 0xEA40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC1F88954F996CAECD8F7C85436C7390;// 0xEAC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C28ACEB645CC80D7064AC5AF1552A250;// 0xEB40(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4F0815A442074C00E8A92CB02BD98C68;// 0xEBC0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_72B7DAE444780BC1210FF0BE87A17997;// 0xEC90(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC1728EB488F3DF80769B1A512E15FC5;// 0xED00(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_24E9D1894E66096BB560FA90E59C9014;// 0xED70(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_7D2FCF944CF30F4C0C06B9AE40BC8AA0;// 0xEDB8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_77F7DA1B4206277A9455E6AC6B0E158C;// 0xEE18(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B758631E4F4265ABFD8370975CB9083A;// 0xEE88(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3E3E58BC402FAC6C6D0B5FB4D8EAEBFA;// 0xEED0(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_946C06B4479274D036028085DA55CEE9;// 0xEFF0(0x0048)
